app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."topic_id" = $1 AND "categories"."id" IN (1) ORDER BY categories.order  [["topic_id", 1]]
---
  def category
    @categories = @topic.categories.where(id: params[:ids])