app/controllers/partners_controller.rb

  def set_partners
    @partners = Partner.all
---
SELECT "partners".* FROM "partners"