app/controllers/values_controller.rb

SELECT "values".* FROM "values" INNER JOIN "categories" ON "values"."category_id" = "categories"."id" WHERE (values.active = true and values.end_date > '2014-05-19') AND "categories"."topic_id" = $1 AND "values"."id" IN (5) ORDER BY values.end_date, categories.order  [["topic_id", 1]]
---
  def value
    @values = @topic.values.where(id: params[:ids])